import dbyolo


# ============================== 일별, 월별 출력 ==========================================
 
date='2022.10.11' # 일별
   # date='2022.10.09' #월별
day_df=dbyolo.perday(date)
print(day_df)


#==============================특정한 구간에서의 출력 ====================================
# date1='2022.10.08'
# date2='2022.10.09'

# during_df = dbyolo.during(date1, date2)
# print()

# ============================== 해당일 기준으로 스트링에서 날짜형식으로 변환 =================================
# day=1
# mark='20222.10.09'
# result_df=dbyolo.frommark(mark,day)
# date=result_df[0][0]
# print(type(date))



